Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_calculating_redundancy_payment.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Calculating redundancy payment
ga: Cás-Staidéar: íocaíocht iomarcaíochta a mheas

source: Linda started her current job on 1 February 2005
ga: Thosaigh Linda a post reatha ar an 1 Feabhra 2005

source: She was given notice of redundancy on 6 July 2012 and her job ended on 31 August 2012
ga: Tugadh fógra iomarcaíochta di ar 6 Iúil 2012 agus tháinig críoch lena post ar an 31 Lúnasa 2012

source: She was laid off from 6 to 10 June 2012
ga: Leagadh as obair í ó 6 go dtí 10 Meitheamh 2012

source: Her gross weekly pay (that is, her weekly pay before tax and other deductions) was €800
ga: Bhí ollphá seachtainiúil (is é sin, a pá seachtainiúil roimh cháin agus asbhaintí eile) de €800 aici

source: Linda wants to know how much her redundancy payment will be
ga: Teastaíonn ó Linda a fháil amach cé mhéid a bheidh a híocaíocht iomarcaíochta

source: The current ceiling on wages that count for redundancy purposes is €600 per week
ga: An t-uasteorainn ar thuarastail a áirítear do chuspóirí iomarcaíochta ná €600 in aghaidh na seachtaine

source: Linda's total service is 7 years and 212 days
ga: 7 mbliana agus 212 lá í an tseirbhís iomlán ag Linda

source: She had no breaks in her continuity of employment
ga: Ní raibh aon bhristeacha aici ina cuid leanúnachas fostaíochta

source: However, the 5 days laid off in June 2012 will reduce her reckonable service to 7 years and 207 days
ga: Cibé ar bith, laghdóidh an 5 lá asleagtha i Meitheamh 2012 a seirbhís inríofa go dtí 7 mbliana agus 207 lá

source: 207 days is 57% (56.71%) of a full year
ga: 207 lá is ea 57% (56.71%) de bhliain iomlán

source: Allowing 2 weeks for each year of service and for part of a year on a pro-rata basis, Linda will be entitled to 16.14 weeks (2 weeks x 7.57 years = 15.14, plus a bonus week). This will give Linda a redundancy payment of 16.14 x €600 = €9,684
ga: Ag ceadú 2 sheachtain do gach bliain seirbhíse agus do chuid de bhliain ar bhonn pro-rata, beidh Linda i dteideal do 16.14 seachtainí (2 sheachtain x 7.57 mbliana = 15.14, móide seachtain sa bhreis)
